{
  "stage": {
    "title": "React lernen und verstehen",
    "date": "April 2019",
    "image": "react-book-portrait-white-medium.jpg",
    "text": [
      "Nach über 3 Jahren in der täglichen Arbeit mit React in über 15 Projekten, in Teams unterschiedlicher Art, Größe und Zusammensetzung und für Unternehmen aus den verschiedensten Branchen, vom Startup bis zum Großkonzern wollte ich meine Erfahrungen aus dieser Zeit gern weitergeben.",
      "Aus diesem Grund entschied ich mich Anfang 2018 ein Buch zu schreiben, welches ich im April 2019 mit über 300 Seiten veröffentlicht habe."
    ]
  },
  "items": [
    {
      "title": "Börse Stuttgart Digital Exchange",
      "role": "Freelance Technical Frontend Lead",
      "date": "December 2019 – October 2020",
      "text": [
        "In meiner Position als Technical Frontend Lead für BSDEX, einem Spin-Off der Börse Stuttgart, war eine meiner ersten Aufgaben die Koordination des Handovers ihrer Web Trading Plattform hin von einem externen Dienstleister zu einem internen Team. Nach dem Handover war ich weiter als aktives Mitglied des Teams an der Entwicklung neuer Features beteiligt und arbeitete fortwährend an der Verbesserung der übernommenen Codebase."
      ],
      "image": "boerse-stuttgart.svg",
      "tech": "JavaScript, TypeScript, ES2015+, React, Hooks, Redux, Jest, React Testing Library, Styled Components, Webpack, i18n, REST, Websockets"
    },
    {
      "title": "Osram Lightelligence",
      "role": "Freelance JavaScript Consultant",
      "date": "Oktober 2019 – Dezember 2020",
      "text": [
        "Im Oktober 2019 schloss ich mich dem Platform-Team des Osram Lightelligence Innovation Hubs an und half ihnen dabei die Prozesse rund um ihre Open Source JavaScript Packages unternehmensweit zu verbessern. Ich diskutierte und führte ESLint Regeln über die verschiedenen Teams hinweg ein, half dabei ihre Release-Prozesse mittels Semantic Release zu automatisieren und arbeitete fortwährend an der Verbesserung ihrer Dokumentation, die ein wesentlicher Faktor ist für den Erfolg von Open Source Projekten."
      ],
      "image": "osram2.svg",
      "tech": "JavaScript, TypeScript, ES2015+, React, Hooks, Redux, Jest, React Testing Library, Semantic Release, ESLint, Webpack"
    },
    {
      "title": "GLS eCom Lab",
      "role": "Freelance JavaScript Consultant",
      "date": "Juli 2019 – September 2019",
      "text": [
        "Für das GLS eCom Lab erstellte ich die technische Grundlage für eine Business Idee die zuvor in einer Pilotphase erfolgreich getestet wurde und implementierte anschließend einen voll-funktionales MVP. Nach der Erstellung einer flexiblen UI Library, die schnell auch in anderen Projekten Einsatz fand, erstellte ich die React-Anwendung völlig von Grund auf bis hin zum erfolgreichen Beta-Launch im September"
      ],
      "image": "gls.svg",
      "tech": "JavaScript, TypeScript, ES2015+, React, Hooks, Redux, Jest, React Testing Library, Storybook, Webpack, i18n, REST, AWS, Infrastructure as Code"
    },
    {
      "title": "Rocket Internet",
      "role": "Freelance JavaScript Architect",
      "date": "Juni 2019",
      "text": [
        "Für Rocket Internet erstellte ich eine React Web-Anwendung die von Beginn an auf Skalierung und Internationalisierung ausgerichtet war. Ich erstellte ein schlankes in-house Design-System in Zusammenarbeit mit einem UI Designer und legte damit die technische Grundlage für ein Kundenportal eines ihrer zukünftigen Ventures"
      ],
      "image": "rocket-internet.svg",
      "tech": "JavaScript, TypeScript, ES2015+, React, Hooks, Redux, Jest, React Testing Library, Storybook, Webpack, i18n, REST, Contentful"
    },
    {
      "title": "Lab 1886 / Daimler",
      "role": "Freelance JavaScript Architect / Developer",
      "image": "daimler.svg",
      "date": "Februar 2019 – März 2019",
      "text": [
        "Für den konzerneigenen Inkubator des Daimler-Konzerns, Lab 1886, konzipierte und entwickelte ich die Frontend-Architektur für das Back Office eines geplanten Großprojekts. Nach der Konzeption der Frontend-Architektur von Grund auf, begann ich die Implementation der Anwendung zusammen mit einem Team aus Frontend- und Backend-Entwicklern."
      ],
      "tech": "JavaScript, ES2015+, React, Hooks, Redux, Jest, Webpack, i18n, REST, TypeScript"
    },
    {
      "title": "KUBIKx / Schmitz Cargobull",
      "role": "Freelance JavaScript Consultant",
      "image": "schmitzcargobull.svg",
      "date": "November 2018 – Januar 2019",
      "text": [
        "Für KUBIKx, den internen Venture Builder des Schmitz Cargobull Konzerns, arbeitete ich an der Entwicklung und technischen Konzeption ihres ersten Ventures mit, beriet und schulte interne Entwickler zum Thema Frontend-Entwicklung mit React und sorgte insbesondere dafür, die bestehende Codebase verständlicher und wartbarer zu machen."
      ],
      "tech": "JavaScript, ES2015+, React, Redux, Jest, Webpack, i18n, REST, TypeScript"
    },
    {
      "title": "Porsche Digital Lab",
      "role": "Interim Tech Lead / Frontend Lead",
      "image": "porsche.svg",
      "date": "Mai 2018 – Oktober 2018",
      "text": [
        "Für ein Venture des Porsche Digital Lab konzipierte ich als Tech- und Frontend Lead die technische Architektur und entwickelte, basierend auf dieser, eine erste Version des Produkts bis zum Launch zusammen mit einem Team aus 10 Entwicklern und Designern."
      ],
      "tech": "JavaScript, ES2015+, React, Redux, Flow, Jest, Webpack, i18n, Node.js, Express, Hapi, REST, TypeScript"
    },
    {
      "title": "Klarna.",
      "hidden": true,
      "role": "Freelance Frontend Consultant",
      "image": "klarna.svg",
      "date": "April 2018",
      "text": [
        "Für den Payment Service Anbieter Klarna beriet ich ein Team von internen Entwicklern bei der Erstellung und Weiterentwicklung der unternehmenseigenen Entwickler-Dokumentation."
      ],
      "tech": "JavaScript, ES2015+, React, Gatsby, Node.js, Webpack, Docker"
    },
    {
      "title": "BCG Digital Ventures",
      "role": "Freelance JavaScript Engineer",
      "image": "bcgdv.svg",
      "date": "January 2018 – März 2018",
      "text": [
        "Für die Digtal Ventures Sparte der Boston Consulting Group entwickelte ich eine Anwendung für „High Precision Farming“. Die Anwendung ermöglicht es Landwirten, Dünge-Entscheidungen basierend auf verschiedenen Typen von Satellitenbildern zu treffen, um so ihr Feld effizienter bewirtschaften zu können."
      ],
      "tech": "HTML, JavaScript, ES2015+, React, Redux, Flow, Jest, Webpack, PostCSS, Enzyme, Node.js, REST, i18n, Mapbox, Boundless SDK"
    },
    {
      "title": "Brickblock",
      "hidden": true,
      "role": "Freelance Fullstack Developer",
      "image": "brickblock.svg",
      "date": "Oktober/November 2017",
      "text": [
        "Für das Blockchain-Startup Brickblock entwickelte ich eine React-Anwendung mit Hilfe derer sich Crypto-Nerds aus aller Welt am ICO (Initial Coin Offering) von Brickblock beteiligen konnten. Darüber hinaus unterstützte ich die Entwicklung einer Platform, mit der weltweit die erste Immobilie über Cryptocurrencies verkauft wird und optimierte und automatisierte einige Prozesse beim Management der eigenen JavaScript-Packages"
      ],
      "tech": "HTML, JavaScript, ES2015+, React, Redux, Flow, Node.js, Webpack, CSS Modules, REST, Styled Components, npmjs.com, i18n, Gitlab-CI"
    },
    {
      "title": "Service Partner ONE",
      "role": "Freelance JavaScript Lead",
      "image": "servicepartnerone.svg",
      "date": "August/September 2017",
      "text": [
        "Bei Service Partner ONE kümmerte ich mich als interim Lead JavaScript Developer in enger Zusammenarbeit mit dem CTO um die technische Konzeption mehrerer neuer Anwendungen des Unternehmens und war an der Auswahl des neuen Lead JavaScript Developers beteiligt."
      ],
      "tech": "HTML, JavaScript, ES2015+, React, Redux, Node.js, Webpack, XHR, CSS Modules, REST, i18n"
    },
    {
      "title": "TomTom Telematics",
      "hidden": true,
      "role": "Freelance JavaScript Developer",
      "image": "tomtom.svg",
      "date": "Juli 2017",
      "text": [
        "Bei TomTom Telematics beriet ich das Webfleet-Team bei der Umsetzung und Optimierung ihrer React-Komponenten. Webfleet ist ein Flottenmanagementsystem das weltweit von über 50.000 Kunden mit über 1 Mio Benutzern in über 10 Sprachen genutzt wird. Die Anwendung ist als React Single Page App realisiert."
      ],
      "tech": "HTML, JavaScript, ES2015+, React, Redux, Node.js, Webpack, REST, i18n"
    },
    {
      "title": "ProSiebenSat.1 Digital",
      "role": "Freelance JavaScript Architect",
      "image": "pro7sat1digital.svg",
      "date": "Februar 2016 – Juni 2017",
      "text": [
        "Für die ProSiebenSat1-Tochter 7NXT entwickelte ich eine React basierte Frontend-Anwendung im Bereich eLearning/Online-Video. Die besondere Herausforderung lag hierbei darin, alle Komponenten sowie auch die Entwicklungsprozesse multi-mandantenfähig und wiederverwendbar zu machen ohne dabei die Wartbarkeit der Anwendung außer Acht zu lassen. Neben der Entwicklung der Anwendungen kümmerte ich mich außerdem um die Gestaltung und Optimierung der Entwicklungs-Prozesse."
      ],
      "tech": "HTML, JavaScript, ES2015+, React, Redux, Node.js, Webpack, Gulp, REST, Sass, i18n"
    },
    {
      "title": "Zalando SE",
      "role": "Freelance JavaScript Developer",
      "image": "zalando.svg",
      "date": "Juni 2015 – Januar 2016",
      "text": [
        "Für Zalando entwickelte ich einige interne Tools um die Prozesse im Frontend zu vereinfachen, zu vereinheitlichen und die Zusammenarbeit mit anderen Disziplinen (Text/Content, Grafik) nahtloser zu gestalten. Dazu gehörte die Konzeption eines auf die Anforderungen der Teams angepasstes Micro-CMS, eine Komponenten-Bibliothek zur Erstellung neuer Shop-Content-Seiten und eine automatisierte Tracking-Lösung."
      ],
      "tech": "HTML, JavaScript, ES2015+, React, Webpack, Node.js, SASS, Less, Handlebars, Grunt, Gulp, JSONSchema, i18n"
    },
    {
      "title": "Amakuria",
      "hidden": true,
      "role": "Fullstack Developer",
      "image": "amakuria.svg",
      "date": "seit Dezember 2014",
      "text": [
        "Als eigenes Projekt startete ich im Februar 2015 die Produkt-Community „Amakuria“. Hier können Besucher die spannendsten, innovativsten oder lustigsten Produkte von Amazon entdecken. Das Projekt dient insbesondere als eigene Spielwiese, um neue Technologien unter Live-Bedingungen zu testen."
      ],
      "tech": "Node.js, Express.js, MySQL, HTML, JavaScript, ES2015+, AJAX/XHR, CSS, SASS, Grunt, Handlebars, Web Components/Polymer"
    },
    {
      "title": "Aperto AG",
      "hidden": true,
      "role": "Freelance Frontend Developer",
      "image": "aperto.svg",
      "date": "Januar 2014 – Mai 2015",
      "text": [
        "Im Auftrag der Aperto AG realisierte ich verschiedene Projekte für den Schweizer Supermarkt „Migros“. Der Online-Auftritt des Konzerns besteht aus knapp einem Dutzend Seitenbereichen die zum Teil sehr unterschiedliche Technologien verwenden. Im Laufe meines Engagements wurde außerdem ein umfangreicher Relaunch der gesamten Online-Aktivitäten geplant, an deren Konzeption und Aufbau ich als Berater und Entwickler im Frontend beteiligt war."
      ],
      "tech": "HTML, JavaScript, ES2015 (via Traceur Compiler), AJAX/XHR, CSS, SASS/Compass, AngularJS, Handlebars, Grunt, Node.js, Require.js, Web Components, i18n"
    },
    {
      "title": "c3 - Creative Code & Content",
      "hidden": true,
      "role": "Freelance Frontend Developer",
      "image": "c3.svg",
      "date": "September 2014 – Oktober 2014",
      "text": [
        "Im Auftrag der c3 GmbH entwickelte eine komplexe interaktive Infografik zur Verwendung im Intranet des Chemiekonzerns Evonik. Die große Herausforderung bestand hier insbesondere darin, die Infografik unter schwierigsten Bedingungen auf allen 22.000 Konzernrechnern - allesamt mit Internet Explorer 7 bestückt - ans Laufen zu bekommen. Mission geglückt, Kunde zufrieden."
      ],
      "tech": "HTML, JavaScript, jQuery, CSS, SASS"
    },
    {
      "title": "Pixelpark AG",
      "hidden": true,
      "role": "Freelance Frontend Developer",
      "image": "pixelpark.svg",
      "date": "Oktober 2013 – Januar 2014",
      "text": [
        "Im Auftrag der Pixelpark AG entwickelte ich für die Online-Versandapotheke DocMorris mehrere Landingpages zur Einbindung in das Shop-System. Dabei wurde eine JSON-API entwickelt durch die Produktinformationen aus dem Shop angefragt und die Landingpages mit den entsprechenden Inhalten befüllt wurden."
      ],
      "tech": "HTML, JavaScript, jQuery, AJAX/XHR, CSS, SASS/Compass, Less, Grunt, PHP"
    },
    {
      "title": "Aperto AG",
      "hidden": true,
      "role": "Freelance Frontend Developer",
      "image": "aperto.svg",
      "date": "August 2013 – Oktober 2013",
      "text": [
        "Für die Aperto AG entwickelte ich als Teil eines größeren interdisziplinären Teams das Frontend für den Relaunch der Website des Drogeriemarkts Rossmann. Hier kümmerte ich mich insbesondere um die Interaktivität der Seite mittels JavaScript und um Client-Server-Kommunikation via AJAX in enger Zusammenarbeit mit dem Backend-Team."
      ],
      "tech": "HTML, JavaScript, jQuery, AJAX/XHR, SASS, Grunt"
    },
    {
      "title": "Handelsblatt/Wirtschaftswoche",
      "role": "Freelance Frontend Lead",
      "image": "handelsblatt.svg",
      "date": "Juni 2012 – Juni 2017",
      "text": [
        "Für die neuen mobilen Webapps des Handelsblatt und der Wirtschaftswoche war ich für die technische Konzeption, den Aufbau und Umsetzung des JavaScript für über 20 verschiedene Zielgeräte (Smartphones und Tablets) sowie für die Koordination mit verschiedenen Dienstleistern verantwortlich. Der Anspruch des Kunden war hier, die technisch hochwertigste mobile Version der Seite zu entwickeln, die nach aktuellem Stand der Browser zu diesem Zeitpunkt möglich war, ohne dabei jedoch alte Endgeräte außen vor zu lassen."
      ],
      "tech": "JavaScript, jQuery, Node.js, AJAX/XHR, CSS, Grunt, Less, Responsive Design"
    },
    {
      "title": "Sevenval GmbH",
      "hidden": true,
      "role": "Freelance Frontend Developer",
      "image": "sevenval.svg",
      "date": "Mai 2012 – September 2012",
      "text": [
        "Für die Sevenval GmbH realisierte ich den Web-Auftritt nach Kundenvorgaben für Zielsysteme von einfachen Android-Smartphones bis hin zu neuen Macbooks mit Retina-Display. Hierzu wurde die kundeneigene Markup-Sprache FITML verwendet, die auf XML und XSL basiert und für die verschiedenen Endgeräte serverseitig optimiertes HTML ausliefert."
      ],
      "tech": "XML, XSL, HTML, JavaScript, CSS, PHP, TYPO3"
    }
  ]
}
